In [12]:
import pandas as pd

Q1: mô tả dữ liệu

In [17]:
df = pd.read_csv('../data/schools.csv')

print(df.info())

print(df.describe())

print(df.head())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 375 entries, 0 to 374
Data columns (total 7 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   school_name      375 non-null    object
 1   borough          375 non-null    object
 2   building_code    375 non-null    object
 3   average_math     375 non-null    int64
 4   average_reading  375 non-null    int64
 5   average_writing  375 non-null    int64
 6   percent_tested   355 non-null    float64
dtypes: float64(1), int64(3), object(3)
memory usage: 20.6+ KB
None
       average_math  average_reading  average_writing  percent_tested
count    375.000000       375.000000       375.000000      355.000000
mean     432.944000       424.504000       418.458667       64.976338
std       71.952373        61.881069        64.548599       18.747634
min      317.000000       302.000000       284.000000       18.500000
25%      386.000000       386.000000       382.000000       50.950000
50%      415.000000       413.000000       403.000000       64.800000
75%      458.500000       445.000000       437.500000       79.600000
max      754.000000       697.000000       693.000000      100.000000
                                         school_name    borough building_code  \
0  New Explorations into Science, Technology and ...  Manhattan          M022
1                               Essex Street Academy  Manhattan          M445
2                       Lower Manhattan Arts Academy  Manhattan          M445
3    High School for Dual Language and Asian Studies  Manhattan          M445
4      Henry Street School for International Studies  Manhattan          M056

   average_math  average_reading  average_writing  percent_tested
0           657              601              601             NaN
1           395              411              387            78.9
2           418              428              415            65.1
3           613              453              463            95.9
4           410              406              381            59.7

Q2: Những trường có điểm Toán tốt nhất là trường mà điểm toán trung bình đạt 80% điểm tối đa (800 điểm). Viết đoạn code xuất ra danh sách các trường có điểm toán tốt nhất, lưu trong DataFrame tên best_math_schools ( gồm các cột "school_name" và  "average_math" , sắp xếp  "average_math"  theo thứ tự giảm dần.

In [14]:
best_math_schools = df[df['average_math'] >= 0.8 * 800][['school_name', 'average_math']]
best_math_schools = best_math_schools.sort_values('average_math', ascending=False)
best_math_schools

                                           school_name  average_math
88                              Stuyvesant High School           754
170                       Bronx High School of Science           714
93                 Staten Island Technical High School           711
365  Queens High School for the Sciences at York Co...           701
68   High School for Mathematics, Science, and Engi...           683
280                     Brooklyn Technical High School           682
333                        Townsend Harris High School           680
174  High School of American Studies at Lehman College           669
0    New Explorations into Science, Technology and ...           657
45                       Eleanor Roosevelt High School           641

Q3: Top 10 các trường có điểm tổng hợp SAT cao nhất
Viết đoạn code xuất ra danh sách 10 trường có điểm SAT tổng hợp cao nhất, lưu trong pandas DataFrame có tên top_10_schools  ( chứa "school_name" và cột mới có tên "total_SAT"), sắp xếp giảm dần theo cột "total_SAT".

In [15]:
df['total_SAT'] = df['average_math'] + df['average_reading'] + df['average_writing']
top_10_schools = df[['school_name', 'total_SAT']].sort_values('total_SAT', ascending=False).head(10)
top_10_schools

                                           school_name  total_SAT
88                              Stuyvesant High School       2144
170                       Bronx High School of Science       2041
93                 Staten Island Technical High School       2041
174  High School of American Studies at Lehman College       2013
333                        Townsend Harris High School       1981
365  Queens High School for the Sciences at York Co...       1947
5                       Bard High School Early College       1914
280                     Brooklyn Technical High School       1896
45                       Eleanor Roosevelt High School       1889
68   High School for Mathematics, Science, and Engi...       1889

Q4: Quận (borough) nào có độ lệch chuẩn của điểm SAT tổng hợp lớn nhất
Lưu kết quả trong pandas DataFrame tên largest_std_dev. DataFrame này chứa 1 hàng gồm các cột "borough", " building_code" , "average_SAT", std_SAT" . Giá trị độ lệch chuẩn làm tròn đến 2 chữ số thập phân.

In [16]:
df['total_SAT'] = df['average_math'] + df['average_reading'] + df['average_writing']
std_dev = df.groupby('borough')['total_SAT'].std()
largest_std_dev_borough = std_dev.idxmax()
largest_std_dev_df = df[df['borough'] == largest_std_dev_borough]
average_SAT = largest_std_dev_df['total_SAT'].mean()
building_code = largest_std_dev_df['building_code'].unique()[0]
largest_std_dev = pd.DataFrame({
    'borough': [largest_std_dev_borough],
    'building_code': [building_code],
    'average_SAT': [round(average_SAT, 2)],
    'std_SAT': [round(std_dev[largest_std_dev_borough], 2)]
})
largest_std_dev

     borough building_code  average_SAT  std_SAT
0  Manhattan          M022      1340.13   230.29